<?php
return array(
    'statistics'                                   => 'Статистика',

    // Statistics
    'Watch statistic'                                    => 'Просмотр статистики',
    'Views and hosts'                                    => 'Просмотры и хосты',
    'Watchers'                                           => 'Просмотров',
    'Hosts'                                              => 'Хосты',
    'Visitors'                                           => 'Посетителей',
    'Views on visitor'                                   => 'Просмотров на посетителя',
    'Views on robots'                                    => 'Просмотров роботами',
    'Robot Google'                                       => 'Робот ПС google',
    'Robot Yandex'                                       => 'Робот ПС yandex',
    'Other site visitors'                                => 'Переходы с других сайтов',
    'From'                                               => 'От',
    'To'                                                 => 'До',
    'Show'                                               => 'Показать',
    'All hosts'                                          => 'Хостов за все время',
    'Host it...'                                         => '*Хост - это уникальный посетитель, фактически - это заход на сайт с разных компьютеров или IP адресов',
    'All hits'                                           => 'Хитов за все время',
    'Hits it...'                                         => '*Хиты(hits) - это просмотры, фактически - это любой просмотр страницы, даже с одного IP',
    'Hosts today'                                        => 'Хостов сегодня',
    'Hits today'                                         => 'Хитов за сегодня',
    'Show bots'                                          => 'Отображать ботов как пользователей',
    'Show bots: info'                                    => 'Позволяет в списке пользователей онлайн отображать поисковых роботов',
    'Users online during the'                            => 'Время, в течение которого считается, что пользователь "on-line"',
    'All'                                                => 'Всего',
);
